
Функция hb_starterGET(Запрос)
	
	//-- формирование данных для шаблона
	
	СоотвтетсвиеДанные = Новый Соответствие();
	СоотвтетсвиеДанные.Вставить("template", "starter");
	
	СоотвтетсвиеДанныеЗаполнения = Новый Соответствие();
	СоотвтетсвиеДанные.Вставить("data", СоотвтетсвиеДанныеЗаполнения);
	
	СоотвтетсвиеДанныеЗаполнения.Вставить("title", "Тестовый заголовок");
	
	МассивДанные = Новый Массив;
	СоотвтетсвиеДанныеЗаполнения.Вставить("arr_data", МассивДанные);
	
	МассивДанные.Добавить("Элемент массива 1");
	МассивДанные.Добавить("Элемент массива 2");
	МассивДанные.Добавить("Элемент массива 3");
	
	СтрокаДанные = В_JSON(СоотвтетсвиеДанные);
	
	//-- формирование, отправка запроса
	
	Заголовоки = Новый Соответствие();
	Заголовоки.Вставить("Content-Type", "application/json");
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Заголовки", Заголовоки);
	
	Ответ = КоннекторHTTP.Post("http://localhost:3000/handlebars", СтрокаДанные, ДополнительныеПараметры);
	
	СтрокаОтвет = КоннекторHTTP.КакТекст(Ответ);

	//-- формирование ответа
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвет);
	Возврат Ответ;
	
КонецФункции

//--

Функция В_JSON(СоответствиеДанные, Отказ = Ложь) Экспорт
	
	Попытка
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		
		ЗаписатьJSON(ЗаписьJSON, СоответствиеДанные);
		
		СтрокаДанные = ЗаписьJSON.Закрыть();
		
		Возврат СтрокаДанные;
		
	Исключение
		
		Отказ = Истина;
		Сообщить(ОписаниеОшибки());
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

Функция ИЗ_JSON(Строка_JSON, Отказ = Ложь) Экспорт
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Строка_JSON);
		
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина);
		
	Исключение
		Отказ = Истина;
		Сообщить(ОписаниеОшибки());
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	
КонецФункции

Функция PingGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

//--
